from neuron import Neuron

if __name__ == '__main__':
    print("Вариант №14")
    print("Задание №1 - Обучение с пороговой функцией активации")
    n = Neuron([0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0], 0.3, False)
    n.learning_partly()
    print("-----------------------------------------------------------------------------------------------------------")
    print("Задание №2 - Обучение с сигмоидальной функцией активации")
    n2 = Neuron([0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0], 0.3, True)
    n2.learning_partly()
